backend/app/controllers/auditions_controller.rb

    def single_show
        render json: Audition.where("musician_id": params[:musician_id])
---
SELECT "auditions".* FROM "auditions" WHERE "auditions"."musician_id" = ?  [["musician_id", 53]]