backend/app/controllers/auditions_controller.rb

SELECT "auditions".* FROM "auditions"
---
    def index
        render json: Audition.all

SELECT "auditions".* FROM "auditions" WHERE "auditions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        audition = Audition.find(params[:id])

INSERT INTO "auditions" ("orchestra", "position", "date", "excerpts", "musician_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "auditions".* FROM "auditions" WHERE "auditions"."musician_id" = ?  [["musician_id", 42]]
INSERT INTO "musicians" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "gary"], ["created_at", "2019-10-02 23:06:55.750477"], ["updated_at", "2019-10-02 23:06:55.750477"]]
SELECT "musicians".* FROM "musicians" WHERE "musicians"."name" = ? LIMIT ?  [["name", "gary"], ["LIMIT", 1]]
---
    def create
        # byebug
        musician = Musician.find_or_create_by(name: params[:audition][:musician_name])
        audition = Audition.create(audition_params)
        audition.musician = musician

        if audition.save

SELECT "auditions".* FROM "auditions" WHERE (2)
---
    def edit
        audition = Audition.find(params[:id])

SELECT "auditions".* FROM "auditions" WHERE "auditions"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
UPDATE "auditions" SET "orchestra" = ?, "date" = ?, "excerpts" = ?, "updated_at" = ? WHERE "auditions"."id" = ?  [["orchestra", "Detroit Symphony"], ["date", "November 11, 2019"], ["excerpts", "http://mag.numop.us/auditions/3796"], ["updated_at", "2019-10-04 17:44:16.281678"], ["id", 64]]
---
    def update
        audition = Audition.find(params[:id])
        audition.update(audition_params)

SELECT "auditions".* FROM "auditions" WHERE "auditions"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]
DELETE FROM "auditions" WHERE "auditions"."id" = ?  [["id", 6]]
---
    def destroy
        # musician = Audition.where("musician_id": params[:musician_id])
        audition = Audition.find(params[:id])
        audition.destroy

SELECT "auditions".* FROM "auditions" WHERE "auditions"."musician_id" = ?  [["musician_id", 7]]
---
    def single_show
        render json: Audition.where("musician_id": params[:musician_id])