backend/app/controllers/musicians_controller.rb

    def index
        render json: Musician.all
---
SELECT "musicians".* FROM "musicians"

    def show
        musician = Musician.find(params[:id])
---
SELECT "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        musician = Musician.find_or_create_by(name: params[:audition][:musician_name])

        if musician.save
---
SELECT "auditions".* FROM "auditions" WHERE "auditions"."musician_id" = ?  [["musician_id", 2]]
UPDATE "auditions" SET "orchestra" = ?, "updated_at" = ? WHERE "auditions"."id" = ?  [["orchestra", "!!!!"], ["updated_at", "2019-10-04 03:05:44.219008"], ["id", 49]]

    def update
        musician = Musician.find(params[:id])
---
SELECT "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def destroy
        musician = Musician.find(params[:id])
        musician.destroy
---
SELECT "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "musicians" WHERE "musicians"."id" = ?  [["id", 18]]